backend/app/controllers/games_controller.rb

    def create
        game = Game.create(game_params)
        if game.save
---
INSERT INTO "games" ("completed", "won", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", 1], ["won", 0], ["user_id", 13], ["created_at", "2021-02-22 03:32:14.583968"], ["updated_at", "2021-02-22 03:32:14.583968"]]