backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        user = User.find_by_id(params[:id])

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Spock"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sulu"], ["created_at", "2021-02-14 03:07:11.257916"], ["updated_at", "2021-02-14 03:07:11.257916"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Cerebella"], ["created_at", "2021-02-14 03:34:00.452433"], ["updated_at", "2021-02-14 03:34:00.452433"]]
---
    def create
        exists = User.find_by(name: params[:name])
        if exists
            render json: exists
        else
            user = User.create(user_params)
            if user.save